# Data sourcing

We are going to source data from various source systems and ingest them using python code.
In practice we can we can have numerous source system types. In this chapter we are going to use some of the frequlty used source systems in the industry. We will focus on below types of ource systems -

1. Parquet files
2. CSV files
3. APIs
4. RDBMS databases
5. HTML

We will be using open source data for Excel, CSV and APIS. We will prepare data for RDBMS and HTML manually.

Let's explore the public saftey data from the New York city avaiable at - https://data.cityofnewyork.us

# Sourcing Parquet data

Let's source the Parquet data from NYC Taxi and Limouseine commision . 
It is an open source data and avaialble for anyone to Download.Please visit the url https://www1.nyc.gov/site/tlc/about/tlc-trip-record-data.page, exapnd the year 2022 and download any data you wish to use for your practice. In this example, we download the data for Yellow taxi from January 2022(file - yellow_tripdata_2022-01.parquet).

Also, make sure to install below package using pip or conda(if you have conda enviroment)-

pip install pyarrow

Now we have everything to ingest the data from this parquet file.

We will use jupyter notebook to make sure the inested data is in desired format and look good.

In [5]:
# Read data from the Parquet file. We use pandas read_parquet method for ease and speed.

import pandas as pd

df_parquet = pd.read_parquet("yellow_tripdata_2022-01.parquet")

#Let's see first five rows if they look good

df_parquet.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee
0,1,2022-01-01 00:35:40,2022-01-01 00:53:29,2.0,3.80,1.0,N,142,236,1,14.5,3.0,0.5,3.65,0.0,0.3,21.95,2.5,0.0
1,1,2022-01-01 00:33:43,2022-01-01 00:42:07,1.0,2.10,1.0,N,236,42,1,8.0,0.5,0.5,4.00,0.0,0.3,13.30,0.0,0.0
2,2,2022-01-01 00:53:21,2022-01-01 01:02:19,1.0,0.97,1.0,N,166,166,1,7.5,0.5,0.5,1.76,0.0,0.3,10.56,0.0,0.0
3,2,2022-01-01 00:25:21,2022-01-01 00:35:23,1.0,1.09,1.0,N,114,68,2,8.0,0.5,0.5,0.00,0.0,0.3,11.80,2.5,0.0
4,2,2022-01-01 00:36:48,2022-01-01 01:14:20,1.0,4.30,1.0,N,68,163,1,23.5,0.5,0.5,3.00,0.0,0.3,30.30,2.5,0.0

# Sourcing CSV data

We will use "Motor Vehicle Collisions - Crashes" data from the NYC open data website - https://data.cityofnewyork.us .
Let's donwload just 500 latest records from this data as we don't need much to data to learn the ingestion for this chapter.

Go ahead and hit the url - https://data.cityofnewyork.us/resource/h9gi-nx95.csv?$limit=500. This will download a csv file h9gi-nx95.csv. Please save this file where jupyter notebook is running(It can be saved anywhere but we will have to give the entire path in that case).

In [6]:
# Read data from the CSV file. We use pandas read_csv method for ease and speed.

import pandas as pd

df_csv = pd.read_csv("h9gi-nx95.csv")

#Let's see first five rows if they look good

df_csv.head()

,crash_date,crash_time,borough,zip_code,latitude,longitude,location,on_street_name,off_street_name,cross_street_name,...,contributing_factor_vehicle_2,contributing_factor_vehicle_3,contributing_factor_vehicle_4,contributing_factor_vehicle_5,collision_id,vehicle_type_code1,vehicle_type_code2,vehicle_type_code_3,vehicle_type_code_4,vehicle_type_code_5
0,2022-07-20T00:00:00.000,1:25,NaN,NaN,40.835808,-73.89083,"\n, \n(40.835808, -73.89083)",BOSTON ROAD,NaN,NaN,...,Unspecified,NaN,NaN,NaN,4547589,Sedan,Sedan,NaN,NaN,NaN
1,2022-07-21T00:00:00.000,5:20,NaN,NaN,NaN,NaN,NaN,FDR DRIVE,NaN,NaN,...,Unspecified,NaN,NaN,NaN,4548075,Sedan,Sedan,NaN,NaN,NaN
2,2021-04-14T00:00:00.000,5:32,NaN,NaN,NaN,NaN,NaN,BRONX WHITESTONE BRIDGE,NaN,NaN,...,Unspecified,NaN,NaN,NaN,4407480,Sedan,Sedan,NaN,NaN,NaN
3,2021-04-13T00:00:00.000,21:35,BROOKLYN,11217.0,40.683580,-73.97617,"(40.68358, -73.97617)",NaN,NaN,620 ATLANTIC AVENUE,...,NaN,NaN,NaN,NaN,4407147,Sedan,NaN,NaN,NaN,NaN
4,2021-04-15T00:00:00.000,16:15,NaN,NaN,NaN,NaN,NaN,HUTCHINSON RIVER PARKWAY,NaN,NaN,...,NaN,NaN,NaN,NaN,4407665,Station Wagon/Sport Utility Vehicle,NaN,NaN,NaN,NaN

# Sourcing data from APIs

In this example, we will see how data can be sourced from an APIs.Data ingestion throuhg APIs an intergal part of modern ETL pipeline development. We will see an example to read data from an API response and load it to pandas dataframe . Please make sure to install the certifi library using - 

pip install certifi or conda install certifi.

In [35]:
import urllib3
from urllib3 import request
import certifi
import json
import pandas as pd

url = 'https://data.cityofnewyork.us/resource/h9gi-nx95.json?$limit=500'
#Check if API is available to retrive the data
apt_status = http.request('GET', url).status
print(apt_status)
if apt_status == 200:
    # Sometimes we get certificate error . We shoul never silence this error as this may cause a securirty threat.
    # Create a Pool manager that can be used to read the API response 
    http = urllib3.PoolManager(cert_reqs='CERT_REQUIRED',ca_certs=certifi.where())
    data = json.loads(http.request('GET', url).data.decode('utf-8'))
    df_api = pd.json_normalize(data)
else:
    df_api = pd.Dataframe()


df_api.head(10)

200

,crash_date,crash_time,latitude,longitude,on_street_name,number_of_persons_injured,number_of_persons_killed,number_of_pedestrians_injured,number_of_pedestrians_killed,number_of_cyclist_injured,...,borough,zip_code,cross_street_name,off_street_name,contributing_factor_vehicle_3,contributing_factor_vehicle_4,vehicle_type_code_3,vehicle_type_code_4,contributing_factor_vehicle_5,vehicle_type_code_5
0,2022-07-20T00:00:00.000,1:25,40.835808,-73.89083,BOSTON ROAD,0,0,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2022-07-21T00:00:00.000,5:20,NaN,NaN,FDR DRIVE,0,0,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2021-04-14T00:00:00.000,5:32,NaN,NaN,BRONX WHITESTONE BRIDGE,0,0,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2021-04-13T00:00:00.000,21:35,40.6835800,-73.9761700,NaN,1,0,1,0,0,...,BROOKLYN,11217,620 ATLANTIC AVENUE,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2021-04-15T00:00:00.000,16:15,NaN,NaN,HUTCHINSON RIVER PARKWAY,0,0,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,2022-07-22T00:00:00.000,0:10,NaN,NaN,ATLANTIC AVENUE,2,0,0,0,0,...,NaN,NaN,NaN,VANWYCK EXPRESSWAY,NaN,NaN,NaN,NaN,NaN,NaN
6,2022-07-20T00:00:00.000,22:15,NaN,NaN,WEST 110 STREET,1,0,0,0,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,2021-04-13T00:00:00.000,16:00,NaN,NaN,VANDERVORT AVENUE,0,0,0,0,0,...,BROOKLYN,11222,NaN,ANTHONY STREET,NaN,NaN,NaN,NaN,NaN,NaN
8,2022-07-22T00:00:00.000,15:54,NaN,NaN,BROOKVILLE BOULEVARD,0,0,0,0,0,...,NaN,NaN,NaN,ROCKAWAY BOULEVARD,NaN,NaN,NaN,NaN,NaN,NaN
9,2021-04-12T00:00:00.000,8:25,0.0000000,0.0000000,EDSON AVENUE,0,0,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Sourcing Data from RDBMS tables

Data can be sourced from RDBMS or non RDBMS tables such as MYSQL, Oracle, MongoDB etc. As we know, there is a very beatuiful in built database that comes by deafult with Python installation. It's known as Sqlite DB . This is a full fleged databse so let's not waste this space in installing external databases.Just to make things easier, we have collected a Sqlite db file - movies.sqlite. Let's use this file as database table.

In [38]:
import pandas as pd
import sqlite3

# Read sqlite query results into a pandas DataFrame
with sqlite3.connect("movies.sqlite") as conn:
    df = pd.read_sql("SELECT * from movies", conn)

df.head()

,id,original_title,budget,popularity,release_date,revenue,title,vote_average,vote_count,overview,tagline,uid,director_id
0,43597,Avatar,237000000,150,2009-12-10,2787965087,Avatar,7.2,11800,"In the 22nd century, a paraplegic Marine is di...",Enter the World of Pandora.,19995,4762
1,43598,Pirates of the Caribbean: At World's End,300000000,139,2007-05-19,961000000,Pirates of the Caribbean: At World's End,6.9,4500,"Captain Barbossa, long believed to be dead, ha...","At the end of the world, the adventure begins.",285,4763
2,43599,Spectre,245000000,107,2015-10-26,880674609,Spectre,6.3,4466,A cryptic message from Bond’s past sends him o...,A Plan No One Escapes,206647,4764
3,43600,The Dark Knight Rises,250000000,112,2012-07-16,1084939099,The Dark Knight Rises,7.6,9106,Following the death of District Attorney Harve...,The Legend Ends,49026,4765
4,43601,John Carter,260000000,43,2012-03-07,284139100,John Carter,6.1,2124,"John Carter is a war-weary, former military ca...","Lost in our world, found in another.",49529,4766

# Sourcing data from Webpages

Often a times, we use webpages to scrap the data to ingest in ETL pipelines. 
Below is an example for loading html tables into Pandas dataframes.We are using wikipedia https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal) to scrap the GDP of all the countries.

In [68]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from unicodedata import normalize

df_html = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)',match = 'by country')
# Let's see how many tables are there with tage ' by county'
print(len(df_html)) # There are 4 tables
# Let's see the first table
df_html[0]

4

    Country/Territory UN Region IMF[1][13]            United Nations[14]  \
    Country/Territory UN Region   Estimate       Year           Estimate
0               World         -   93863851       2021           87461674
1       United States  Americas   25346805       2022           20893746
2               China      Asia   19911593  [n 2]2022           14722801
3               Japan      Asia    4912147       2022            5057759
4             Germany    Europe    4256540       2022            3846414
..                ...       ...        ...        ...                ...
212             Palau   Oceania        244       2022                264
213          Kiribati   Oceania        216       2022                181
214             Nauru   Oceania        134       2022                135
215        Montserrat  Americas          —          —                 68
216            Tuvalu   Oceania         66       2022                 55

               World Bank[15][16]
          Year           Estimate  Year
0         2020           96100091  2021
1         2020           22996100  2021
2    [n 3]2020           17734063  2021
3         2020            4937422  2021
4         2020            4223116  2021
..         ...                ...   ...
212       2020                258  2020
213       2020                181  2020
214       2020                133  2021
215       2020                  —     —
216       2020                 63  2021

[217 rows x 8 columns]

Now we have an idea on how we can source data from multiple source systems.